#+TITLE:XenHunt Config (customize)
#+AUTHOR: Evgeny Berlizov (XenHunt)
#+DESCRIPTION: XenHunt's config of customization
#+STARTUP: content
#+PROPERTY: header-args :tangle beauty.el
** Catppucin
:PROPERTIES:
:CUSTOM_ID: catppucin
:END:
#+begin_src emacs-lisp
(use-package catppuccin-theme
  :custom
  (catppuccin-flavor 'mocha)
  :config
  (load-theme 'catppuccin t))
#+end_src

#+RESULTS:
: [nil 26776 53255 492234 nil elpaca-process-queues nil nil 986000 nil]

** Themes
:PROPERTIES:
:CUSTOM_ID: themes
:END:
#+begin_src emacs-lisp
(use-package autothemer)
;; (use-package neofusion-emacs
;;   :after autothemer
;;   ;; :load-path "themes"
;;   :ensure (:type git :host github :repo "konrad1977/neofusion-emacs" :branch "main" :main "neofusion-theme.el"))
(use-package exotica-theme
  :config
  ;; (load-theme 'exotica t)
  )
;; (after! exotica-theme
;; (load-theme 'exotica t))
;; (use-package rose-pine-emacs
;;   :ensure (:type git :host github :repo "thongpv87/rose-pine-emacs" :branch "main" :main "rose-pine-color-theme.el" :files ("*.el"))
;;   :init
;;   (add-to-list 'custom-theme-load-path (concat elpaca-builds-directory "/rose-pine-emacs")))
#+end_src

#+RESULTS:
: [nil 26474 45152 278817 nil elpaca-process-queues nil nil 252000 nil]

** Outline-Indent
:PROPERTIES:
:CUSTOM_ID: outline-indent
:END:
#+begin_src emacs-lisp
(use-package outline-indent
  :ensure t
  :custom
  (outline-indent-ellipsis " ▼ "))
#+end_src

#+RESULTS:
: [nil 26436 37702 488240 nil elpaca-process-queues nil nil 855000 nil]

** Spacious-padding
:PROPERTIES:
:CUSTOM_ID: spacious-padding
:END:
#+begin_src emacs-lisp
;; (use-package spacious-padding
;;   :custom
;;   (spacious-padding-widths
;;    '( :internal-border-width 15
;;       :header-line-width 4
;;       :mode-line-width 6
;;       :tab-width 4
;;       :right-divider-width 30
;;       :scroll-bar-width 8
;;       :fringe-width 8))
;;   ;; (spacious-padding-mode nil)
;;   :hook ((org-mode nov-mode yaml-mode ) . spacious-padding-mode)
;;   :config
;;   (spacious-padding-mode -1)
;;   )
#+end_src

#+RESULTS:
: [nil 26445 48695 884954 nil elpaca-process-queues nil nil 293000 nil]

** Dashboard 
:PROPERTIES:
:CUSTOM_ID: dashboard
:END:
#+begin_src emacs-lisp
(use-package dashboard
  :init
  (setq dashboard-set-file-icons t)
  (setq dashboard-set-heading-icons t)
  (setq dashboard-display-icons-p t)
  (defvar dashboard-books-alist nil
    "List of books for dashboard")

  (defun my/reload-dashboard ()
    (remove-hook 'server-after-make-frame-hook 'my/reload-dashboard)
    (remove-hook 'after-make-frame-functions 'my/reload-dashboard)
    (let ((original-buffer (current-buffer)))
      (dashboard--with-buffer
        (revert-buffer t t))
      (switch-to-buffer original-buffer)))
  (if (daemonp)
      (add-hook 'server-after-make-frame-hook 'my/reload-dashboard)
    (add-hook 'after-make-frame-functions 'my/reload-dashboard))

  (defun get-recent-books (&optional list-size)
    "Returns a list of recent books (PDF, EPUB, DJVU) based on LIST-SIZE"
    (let ((list-size (or list-size 10))
          result
          )
      (dolist (element recentf-list)
        (when (and (file-name-extension element) (or (string= (downcase (file-name-extension element)) "pdf")
                                                     (string= (downcase (file-name-extension element)) "epub")
                                                     (string= (downcase (file-name-extension element)) "djvu")))
          (add-to-list 'result element)))
      (nreverse (cl-subseq result 0 (min (length result) list-size)))
      )
    )
  (defun my/dashboard-insert-books (list-size)
    "Add the list of LIST-SIZE items of recent books"
    (dashboard-insert-section
     "Books"
     (dashboard-shorten-paths (get-recent-books list-size) 'dashboard-books-alist 'books)
     list-size
     'books
     (dashboard-get-shortcut 'books)
     `(lambda (&rest ignore)
        (find-file-existing (dashboard-expand-path-alist ,el dashboard-books-alist))
        (dashboard-refresh-buffer)
        )
     (format "%s" el)))
  
  :custom
  (dashboard-modify-heading-icons '((recents . "file-text")
                                    (bookmarks . "book")))
  (dashboard-items '(
		             (recents . 5)
		             (bookmarks . 5)
		             (projects . 5)
		             (agenda . 5)
                     ;; (books . 5)
                     ))
  (dashboard-item-shortcuts '(
			                  (recents   . "r")
                              (bookmarks . "m")
                              (projects  . "p")
			                  (agenda . "a")
                              ;; (books . "b")
                              ))
  (dashboard-projects-backend 'projectile)
  (dashboard-startup-banner "~/.emacs.d/logo.png")
  :config
  (defun switch-to-dashboard ()
    (switch-to-buffer "*dashboard*"))

  (add-to-list 'dashboard-item-shortcuts '(books . "b"))
  (add-to-list 'dashboard-item-generators  '(books . my/dashboard-insert-books))
  ;; (add-to-list 'dashboard-items '(books . 5))
  
  (add-hook 'elpaca-after-init-hook #'dashboard-insert-startupify-lists)
  (add-hook 'elpaca-after-init-hook #'dashboard-initialize)
  
  (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
  (dashboard-setup-startup-hook)
  )
#+end_src

#+RESULTS:
: [nil 26328 32309 232892 nil elpaca-process-queues nil nil 53000 nil]

** Ligatures 
:PROPERTIES:
:CUSTOM_ID: ligatures
:END:
#+begin_src emacs-lisp
(use-package ligature
  :config
  (ligature-set-ligatures 'prog-mode '("--" "---" "==" "===" "!=" "!==" "=!="
                              "=:=" "=/=" "<=" ">=" "&&" "&&&" "&=" "++" "+++" "***" ";;" "!!"
                              "??" "???" "?:" "?." "?=" "<:" ":<" ":>" ">:" "<:<" "<>" "<<<" ">>>"
                              "<<" ">>" "||" "-|" "_|_" "|-" "||-" "|=" "||=" "##" "###" "####"
                              "#{" "#[" "]#" "#(" "#?" "#_" "#_(" "#:" "#!" "#=" "^=" "<$>" "<$"
                              "$>" "<+>" "<+" "+>" "<*>" "<*" "*>" "</" "</>" "/>" "<!--" "<#--"
                              "-->" "->" "->>" "<<-" "<-" "<=<" "=<<" "<<=" "<==" "<=>" "<==>"
                              "==>" "=>" "=>>" ">=>" ">>=" ">>-" ">-" "-<" "-<<" ">->" "<-<" "<-|"
                              "<=|" "|=>" "|->" "<->" "<~~" "<~" "<~>" "~~" "~~>" "~>" "~-" "-~"
                              "~@" "[||]" "|]" "[|" "|}" "{|" "[<" ">]" "|>" "<|" "||>" "<||"
                              "|||>" "<|||" "<|>" "..." ".." ".=" "..<" ".?" "::" ":::" ":=" "::="
                              ":?" ":?>" "//" "///" "/*" "*/" "/=" "//=" "/==" "@_" "__" "???"
                              "<:<" ";;;"))
  (global-ligature-mode t))
#+end_src

#+RESULTS:
: [nil 26384 3261 275682 nil elpaca-process-queues nil nil 171000 nil]

** Ultra-Scroll
:PROPERTIES:
:CUSTOM_ID: ultra-scroll
:END:
#+begin_src emacs-lisp
(use-package ultra-scroll
  :ensure (ultra-scroll :host github :repo "jdtsmith/ultra-scroll")
  :init
  (setq scroll-conservatively 101 ; important!
        scroll-margin 0)
  :config
  (ultra-scroll-mode 1))
#+end_src

#+RESULTS:
: [nil 26495 36291 189800 nil elpaca-process-queues nil nil 888000 nil]

